---
type: IExternalDBApplication
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# IExternalDBApplication

`Autodesk.Revit.DB.IExternalDBApplication` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnShutdown | — | `ExternalDBApplicationResult OnShutdown ( ControlledApplication application )` |
| Method | OnStartup | — | `ExternalDBApplicationResult OnStartup ( ControlledApplication application )` |